app/controllers/articles_controller.rb

  def index
    if params[:user_id]
      @user = User.find( params[:user_id] )
      @articles = @user.articles.order(created_at: :desc).page params[:page]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "articles" WHERE "articles"."user_id" = ? ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?) subquery_for_count  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]

  def latest
    @articles = Article.last(10).reverse
---
SELECT  `articles`.* FROM `articles` ORDER BY `articles`.`id` DESC LIMIT 10

  def create
    @article = Article.new(article_params)
    @article.user = @current_user
    @article.category = Category.find( @article.category_id )
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def set_categories
    @categories = []
    Category.all.each do |category|
---
SELECT `categories`.* FROM `categories`