app/controllers/categories_controller.rb

  def show
    @articles = @category.articles.order(created_at: :desc).page params[:page]
---
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY "articles"."created_at" DESC  [["category_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]