app/controllers/comments_controller.rb

    def index
        if @current_user
          if @current_user.is_super_admin
            @comments = Comment.all
---
SELECT "comments".* FROM "comments"

    def create
        @article = Article.find( params[:article_id] )
        @current_user.comments.create(comment_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`user_id`, `article_id`, `comment_id`, `content`, `created_at`, `updated_at`) VALUES (2, 2, 2, 'QQQ', '2017-06-28 07:45:06', '2017-06-28 07:45:06')