app/controllers/images_controller.rb

INSERT INTO `images` (`file`, `user_id`, `created_at`, `updated_at`) VALUES ('2017/6/28/586ca0706df981c81da2b2048e5b5301.jpg', 5, '2017-06-28 07:31:09', '2017-06-28 07:31:09')
---
    def upload
        @image = Image.new
        @image.file = params[:upload_file]
        @image.user = @current_user
        success = false
        msg = 'upload success'
        if @image.save