app/controllers/users_controller.rb

INSERT INTO "users" ("name", "telphone", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        respond_to do |format|
            if @user.save

UPDATE `users` SET `name` = 'admin<script>alert(1);</script>', `updated_at` = '2017-06-28 07:36:18' WHERE `users`.`id` = 2
---
    def update
        respond_to do |format|
            if @user.update(user_params)